# Pandas:
- Pandas is a powerful python library for data analysis and manipulation. It is widely used in fields relating to data analytics and data science along with ML. Pandas can read data not only from excel (.csv/.xlsx) files but also from SQL databases.

# Basic pandas functions:
- Pandas has a lot of inbuilt functions for data analysis and manipulation. Some of them are listed below:

    - `read_csv()` &#8594; Reads the data from csv files.
    - `read_excel()` &#8594; Reads the data from excel files.
    - `apply()` &#8594; Applies a function to the specified row of the DataFrame.
    - `fillna()` &#8594; Fills the empty data of the DataFrame with an specified value (normally mean or median i used.)
    - `describe()` &#8594; Generates  information like mean,median,sum and so on for the DataFrame.
    - `value_counts()` &#8594; Returns the frequenct of a certain value in a specified column of the DataFrame.
    - `to_csv()` &#8594; Saves the DataFrame as a CSV file.

# Let's get coding !

In [1]:
import pandas as pd

df = pd.read_csv(r"Salary Data.csv")

`.head()` &#8594; The `head()` function displays the top 5 rows from your df by default. To change the number of rows displayed, simply pass the number of rows you want.
`tail()` &#8594; The `tail()` function works exactly the same as teh `head()` function, except it returns the rows from the bottom.

In [2]:
df.head(4)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0

In [3]:
df.tail(4)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

`.describe()` &#8594; The describe function, describes the DataFrame. It returns a smaller dataframe including the count,mean,standard deviation, the quartiles and the max value of the numerical columns in the dataframe.

In [4]:
df.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

`.info()` &#8594; Prints the basic information like the data type of each column about the dataframe. Use ful to figure what type of funciton to use in which column.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB